benchmarks/final_llama_13b_A6000_alpaca_selective_validation/colocation_consolidated_7_0_16_alpaca_output.txt
INFO 06-15 23:36:36 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', dataset_name='alpaca', dataset_path=None, max_concurrency=None, model='huggyllama/llama-13b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=16.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 52002 samples from cache from vicgalle/cache/alpaca_huggyllama/llama-13b.json
Split dataset into 5200 test samples and 46802 training samples
Temperature:  0.0
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
result {'is_trained': True}
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 16.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     4322      
Benchmark duration (s):                  300.18    
Total input tokens:                      265821    
Total generated tokens:                  698382    
Request throughput (req/s):              14.40     
Output token throughput (tok/s):         2326.53   
Total Token throughput (tok/s):          3212.06   
---------------Time to First Token----------------
Mean TTFT (ms):                          1757.09   
Median TTFT (ms):                        888.95    
P99 TTFT (ms):                           8220.56   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          107.64    
Median TPOT (ms):                        90.96     
P99 TPOT (ms):                           337.98    
---------------Inter-token Latency----------------
Mean ITL (ms):                           392.75    
Median ITL (ms):                         419.01    
P99 ITL (ms):                            791.50    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          15498.37  
Median E2EL (ms):                        11889.42  
P99 E2EL (ms):                           55128.16  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 154.47    
Median Token Latency (ms):               107.79    
P99 Token Latency (ms):                  829.03    
==================================================